# Before your start:
- Read the README.md file
- Comment as much as you can and use the resources (README.md file)
- Happy learning!

In [148]:
import numpy  as np
import pandas as pd

# Challenge 1 - Exploring the Data

In this challenge, we will examine all salaries of employees of the City of Chicago. We will start by loading the dataset and examining its contents

In [149]:
# Run this code:

salaries = pd.read_csv('../Current_Employee_Names__Salaries__and_Position_Titles.csv')

Examine the `salaries` dataset using the `head` function below.

In [150]:
# Your code here:
salaries.head()

,Name,Job Titles,Department,Full or Part-Time,Salary or Hourly,Typical Hours,Annual Salary,Hourly Rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

We see from looking at the `head` function that there is quite a bit of missing data. Let's examine how much missing data is in each column. Produce this output in the cell below

In [151]:
salaries.columns=[e.lower().replace(' ', '_') for e in salaries.columns]

salaries.head()

,name,job_titles,department,full_or_part-time,salary_or_hourly,typical_hours,annual_salary,hourly_rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

In [152]:
# Your code here:
salaries.info('deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33183 entries, 0 to 33182
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               33183 non-null  object
 1   job_titles         33183 non-null  object
 2   department         33183 non-null  object
 3   full_or_part-time  33183 non-null  object
 4   salary_or_hourly   33183 non-null  object
 5   typical_hours      8022 non-null   float64
 6   annual_salary      25161 non-null  float64
 7   hourly_rate        8022 non-null   float64
dtypes: float64(3), object(5)
memory usage: 2.0+ MB

Let's also look at the count of hourly vs. salaried employees. Write the code in the cell below

In [153]:
# Your code here:

salaries.salary_or_hourly.value_counts()

Salary    25161
Hourly     8022
Name: salary_or_hourly, dtype: int64

In [154]:
salaries.typical_hours.value_counts()

40.0    5833
20.0    1901
10.0     184
35.0     104
Name: typical_hours, dtype: int64

What this information indicates is that the table contains information about two types of employees - salaried and hourly. Some columns apply only to one type of employee while other columns only apply to another kind. This is why there are so many missing values. Therefore, we will not do anything to handle the missing values.

There are different departments in the city. List all departments and the count of employees in each department.

In [155]:
# Your code here:
salaries.department.value_counts()

POLICE                   13414
FIRE                      4641
STREETS & SAN             2198
OEMC                      2102
WATER MGMNT               1879
AVIATION                  1629
TRANSPORTN                1140
PUBLIC LIBRARY            1015
GENERAL SERVICES           980
FAMILY & SUPPORT           615
FINANCE                    560
HEALTH                     488
CITY COUNCIL               411
LAW                        407
BUILDINGS                  269
COMMUNITY DEVELOPMENT      207
BUSINESS AFFAIRS           171
COPA                       116
BOARD OF ELECTION          107
DoIT                        99
PROCUREMENT                 92
INSPECTOR GEN               87
MAYOR'S OFFICE              85
CITY CLERK                  84
ANIMAL CONTRL               81
HUMAN RESOURCES             79
CULTURAL AFFAIRS            65
BUDGET & MGMT               46
ADMIN HEARNG                39
DISABILITIES                28
TREASURER                   22
HUMAN RELATIONS             16
BOARD OF ETHICS              8
POLICE BOARD                 2
LICENSE APPL COMM            1
Name: department, dtype: int64

# Challenge 2 - Hypothesis Tests

In this section of the lab, we will test whether the hourly wage of all hourly workers is significantly different from $30/hr. Import the correct one sample test function from scipy and perform the hypothesis test for a 95% two sided confidence interval.

In [156]:
#%pip install statsmodels and %pip install scikit-learn
from scipy.stats import t
from scipy.stats import ttest_rel  # testeo con dos muestras
from statsmodels.stats import weightstats as w
from scipy.stats import shapiro
from scipy.stats import sem
from scipy.stats import ttest_ind  # testeo de independencia
from scipy.stats import ttest_1samp

In [157]:
hourly =salaries.dropna(subset=['hourly_rate'])
print(hourly)

                         name                      job_titles  \
4           ABASCAL,  REECE E     TRAFFIC CONTROL AIDE-HOURLY
6       ABBATACOLA,  ROBERT J             ELECTRICAL MECHANIC
7          ABBATE,  JOSEPH L          POOL MOTOR TRUCK DRIVER
10           ABBOTT,  BETTY L              FOSTER GRANDPARENT
18       ABDULLAH,  LAKENYA N                  CROSSING GUARD
...                       ...                             ...
33164        ZUREK,  FRANCIS              ELECTRICAL MECHANIC
33168  ZWARYCZ MANN,  IRENE A                  CROSSING GUARD
33169      ZWARYCZ,  THOMAS J         POOL MOTOR TRUCK DRIVER
33174        ZYGADLO,  JOHN P          MACHINIST (AUTOMOTIVE)
33175     ZYGADLO,  MICHAEL J  FRM OF MACHINISTS - AUTOMOTIVE

             department full_or_part-time salary_or_hourly  typical_hours  \
4                  OEMC                 P           Hourly           20.0
6              AVIATION                 F           Hourly           40.0
7         STREETS & SAN                 F           Hourly           40.0
10     FAMILY & SUPPORT                 P           Hourly           20.0
18                 OEMC                 P           Hourly           20.0
...                 ...               ...              ...            ...
33164              OEMC                 F           Hourly           40.0
33168              OEMC                 P           Hourly           20.0
33169       WATER MGMNT                 F           Hourly           40.0
33174  GENERAL SERVICES                 F           Hourly           40.0
33175  GENERAL SERVICES                 F           Hourly           40.0

       annual_salary  hourly_rate
4                NaN        19.86
6                NaN        46.10
7                NaN        35.60
10               NaN         2.65
18               NaN        17.68
...              ...          ...
33164            NaN        46.10
33168            NaN        17.68
33169            NaN        35.60
33174            NaN        46.35
33175            NaN        48.85

[8022 rows x 8 columns]

In [158]:
hourly.describe().T

                count       mean        std    min   25%   50%   75%    max
typical_hours  8022.0  34.507604   9.252077  10.00  20.0  40.0  40.0   40.0
annual_salary     0.0        NaN        NaN    NaN   NaN   NaN   NaN    NaN
hourly_rate    8022.0  32.788558  12.112573   2.65  21.2  35.6  40.2  109.0

In [159]:
# decido coger una muestra de los 3000 primeros

hourly_3K = hourly.iloc[:3000]

In [160]:
# testemos que el hourly_rate es "normal" con shapiro - bastante normal al estar muy cerca de 0


shapiro(hourly_3K.hourly_rate)

ShapiroResult(statistic=0.9322100877761841, pvalue=6.59595135007829e-35)

In [161]:
# el test de confidencialidad indica  un rango muy pequeño

t.interval(0.95, len(hourly_3K.hourly_rate)-1, loc=hourly_3K.hourly_rate.mean(), scale=sem(hourly_3K.hourly_rate))

(32.14997209648112, 33.013361236852205)

In [162]:
# Es buena h1  - no se
# 
t_test=ttest_1samp(hourly_3K['hourly_rate'], 30)
t_test

Ttest_1sampResult(statistic=11.725921516469569, pvalue=4.430566267413816e-31)

We are also curious about salaries in the police force. The chief of police in Chicago claimed in a press briefing that salaries this year are higher than last year's mean of $86000/year a year for all salaried employees. Test this one sided hypothesis using a 95% confidence interval.

Hint: A one tailed test has a p-value that is half of the two tailed p-value. If our hypothesis is greater than, then to reject, the test statistic must also be positive.

In [163]:
hourly_3K = salaries.iloc[:3000]



policia = hourly_3K.department, hourly_3K.annual_salary

policia2 = hourly_3K.loc[hourly_3K['department'] == 'POLICE']
policia2

,name,job_titles,department,full_or_part-time,salary_or_hourly,typical_hours,annual_salary,hourly_rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
9,"ABBATE, TERRY M",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
11,"ABDALLAH, ZAID",POLICE OFFICER,POLICE,F,Salary,NaN,84054.0,NaN
12,"ABDELHADI, ABDALMAHD",POLICE OFFICER,POLICE,F,Salary,NaN,87006.0,NaN
...,...,...,...,...,...,...,...,...
2993,"BROADWAY, MARCUS A",POLICE OFFICER,POLICE,F,Salary,NaN,93354.0,NaN
2994,"BROADWAY, MARGIE D",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
2996,"BROCK, STEVEN E",POLICE OFFICER,POLICE,F,Salary,NaN,90024.0,NaN
2998,"BRODERICK, JOHN A",LIEUTENANT,POLICE,F,Salary,NaN,127692.0,NaN
2999,"BRODERICK, JOHN P",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,100980.0,NaN

In [164]:
policia2.describe().T

,count,mean,std,min,25%,50%,75%,max
typical_hours,1.0,20.000000,NaN,20.00,20.00,20.00,20.00,20.00
annual_salary,1269.0,85733.735225,19118.02268,38376.00,77520.00,90024.00,94122.00,174996.00
hourly_rate,1.0,9.270000,NaN,9.27,9.27,9.27,9.27,9.27

In [165]:
# Your code here:

t_test=ttest_1samp(policia2['annual_salary'].dropna(), 86000, alternative= 'greater')
t_test

Ttest_1sampResult(statistic=-0.4961369303547472, pvalue=0.6900581042889868)

Using the `crosstab` function, find the department that has the most hourly workers.

In [166]:
cross = pd.crosstab(salaries.department, salaries.salary_or_hourly)

cross

# STREETS & SAN

salary_or_hourly       Hourly  Salary
department
ADMIN HEARNG                0      39
ANIMAL CONTRL              19      62
AVIATION                 1082     547
BOARD OF ELECTION           0     107
BOARD OF ETHICS             0       8
BUDGET & MGMT               2      44
BUILDINGS                   0     269
BUSINESS AFFAIRS            7     164
CITY CLERK                  0      84
CITY COUNCIL               64     347
COMMUNITY DEVELOPMENT       4     203
COPA                        0     116
CULTURAL AFFAIRS            7      58
DISABILITIES                0      28
DoIT                        0      99
FAMILY & SUPPORT          287     328
FINANCE                    44     516
FIRE                        2    4639
GENERAL SERVICES          765     215
HEALTH                      3     485
HUMAN RELATIONS             0      16
HUMAN RESOURCES             4      75
INSPECTOR GEN               0      87
LAW                        40     367
LICENSE APPL COMM           0       1
MAYOR'S OFFICE              8      77
OEMC                     1273     829
POLICE                     10   13404
POLICE BOARD                0       2
PROCUREMENT                 2      90
PUBLIC LIBRARY            299     716
STREETS & SAN            1862     336
TRANSPORTN                725     415
TREASURER                   0      22
WATER MGMNT              1513     366

The workers from the department with the most hourly workers have complained that their hourly wage is less than $35/hour. Using a one sample t-test, test this one-sided hypothesis at the 95% confidence level.

In [175]:
# Your code here:

streets = hourly_3K.loc[hourly_3K['department'] == 'STREETS & SAN']

streets

,name,job_titles,department,full_or_part-time,salary_or_hourly,typical_hours,annual_salary,hourly_rate
7,"ABBATE, JOSEPH L",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
21,"ABDUL-SHAKUR, TAHIR",GENERAL LABORER - DSS,STREETS & SAN,F,Hourly,40.0,NaN,21.43
24,"ABERCROMBIE, TIMOTHY",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
36,"ABRAMS, DANIELLE T",SANITATION LABORER,STREETS & SAN,F,Hourly,40.0,NaN,36.21
39,"ABRAMS, SAMUEL A",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
...,...,...,...,...,...,...,...,...
2932,"BREWINGTON, TONY",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,36.13
2971,"BRINGLE, JUSTIN",POOL MOTOR TRUCK DRIVER,STREETS & SAN,P,Hourly,10.0,NaN,28.48
2979,"BRISCOE, KENNETH",POOL MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60
2982,"BRISKER, DARRYL A",ADMINISTRATIVE ASST III,STREETS & SAN,F,Salary,NaN,63876.0,NaN
2986,"BRITTMAN, JULIUS",MOTOR TRUCK DRIVER,STREETS & SAN,F,Hourly,40.0,NaN,35.60

In [168]:
streets_2=ttest_1samp(streets['hourly_rate'].dropna(), 35, alternative= 'less')
streets_2

Ttest_1sampResult(statistic=-3.9543860827063297, pvalue=5.458554647190791e-05)

# Challenge 3 - Constructing Confidence Intervals

While testing our hypothesis is a great way to gather empirical evidence for accepting or rejecting the hypothesis, another way to gather evidence is by creating a confidence interval. A confidence interval gives us information about the true mean of the population. So for a 95% confidence interval, we are 95% sure that the mean of the population is within the confidence interval. 
).

To read more about confidence intervals, click [here](https://en.wikipedia.org/wiki/Confidence_interval).


In the cell below, we will construct a 95% confidence interval for the mean hourly wage of all hourly workers. 

The confidence interval is computed in SciPy using the `t.interval` function. You can read more about this function [here](https://docs.scipy.org/doc/scipy-0.14.0/reference/generated/scipy.stats.t.html).

To compute the confidence interval of the hourly wage, use the 0.95 for the confidence level, number of rows - 1 for degrees of freedom, the mean of the sample for the location parameter and the standard error for the scale. The standard error can be computed using [this](https://docs.scipy.org/doc/scipy/reference/generated/scipy.stats.sem.html) function in SciPy.

In [172]:
from scipy.stats import sem   # error estandar

In [173]:
hourly_confidence =salaries.dropna(subset=['hourly_rate'])

In [174]:
# Your code here:

t.interval(0.95, len(hourly_confidence.hourly_rate)-1, loc=hourly_confidence.hourly_rate.mean(), scale=sem(hourly_confidence.hourly_rate))

(32.52345834488425, 33.05365708767623)

Now construct the 95% confidence interval for all salaried employeed in the police in the cell below.

In [177]:
# Your code here:

policia_confidence =policia2.dropna(subset=['annual_salary'])

t.interval(0.95, len(policia_confidence.annual_salary)-1, loc=policia_confidence.annual_salary.mean(), scale=sem(policia_confidence.annual_salary))

(84680.8646269071, 86786.60582226547)

# Challenge 4 - Hypothesis Tests of Proportions

Another type of one sample test is a hypothesis test of proportions. In this test, we examine whether the proportion of a group in our sample is significantly different than a fraction. 

You can read more about one sample proportion tests [here](http://sphweb.bumc.bu.edu/otlt/MPH-Modules/BS/SAS/SAS6-CategoricalData/SAS6-CategoricalData2.html).

In the cell below, use the `proportions_ztest` function from `statsmodels` to perform a hypothesis test that will determine whether the number of hourly workers in the City of Chicago is significantly different from 25% at the 95% confidence level.

In [179]:
# Your code here:
from statsmodels.stats.proportion import proportions_ztest

In [192]:
salaries.head()

,name,job_titles,department,full_or_part-time,salary_or_hourly,typical_hours,annual_salary,hourly_rate
0,"AARON, JEFFERY M",SERGEANT,POLICE,F,Salary,NaN,101442.0,NaN
1,"AARON, KARINA",POLICE OFFICER (ASSIGNED AS DETECTIVE),POLICE,F,Salary,NaN,94122.0,NaN
2,"AARON, KIMBERLEI R",CHIEF CONTRACT EXPEDITER,GENERAL SERVICES,F,Salary,NaN,101592.0,NaN
3,"ABAD JR, VICENTE M",CIVIL ENGINEER IV,WATER MGMNT,F,Salary,NaN,110064.0,NaN
4,"ABASCAL, REECE E",TRAFFIC CONTROL AIDE-HOURLY,OEMC,P,Hourly,20.0,NaN,19.86

In [195]:
z_score, p_value = proportions_ztest(salaries['salary_or_hourly'].value_counts()[1], len(salaries['salary_or_hourly']), 0.25)

z_score, p_value

(-3.5099964213703005, 0.0004481127249057967)